
#set_false_path -from [get_ports reset]
set CLOCK	5.406

create_clock -period [expr $CLOCK] -name clk -add [get_ports clk]
set_clock_uncertainty -setup [expr $CLOCK*0.01] [get_ports clk]
set_clock_uncertainty -hold [expr $CLOCK*0.01] [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image0[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image0[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image1[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image1[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image10[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image10[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image11[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image11[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image12[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image12[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image13[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image13[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image14[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image14[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image15[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image15[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image16[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image16[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image17[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image17[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image18[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image18[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image2[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image2[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image20[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image20[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image21[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image21[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image22[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image22[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image23[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image23[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image24[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image24[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image25[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image25[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image26[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image26[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image27[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image27[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image28[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image28[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image29[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image29[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image3[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image3[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image30[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image30[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image31[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image31[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image4[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image4[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image5[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image5[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image6[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image6[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image7[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image7[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image8[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image8[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image9[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image9[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld0]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld0]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld1]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld1]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld10]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld10]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld11]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld11]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld12]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld12]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld13]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld13]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld14]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld14]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld15]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld15]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld16]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld16]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld17]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld17]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld18]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld18]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld19]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld19]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld2]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld2]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld20]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld20]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld21]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld21]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld22]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld22]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld23]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld23]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld24]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld24]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld25]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld25]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld26]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld26]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld27]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld27]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld28]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld28]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld29]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld29]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld3]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld3]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld30]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld30]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld31]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld31]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld4]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld4]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld5]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld5]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld6]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld6]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld7]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld7]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld8]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld8]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld9]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld9]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports reset]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports reset]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {result_all[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {result_all[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy0]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy0]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy1]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy1]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy10]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy10]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy11]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy11]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy12]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy12]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy13]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy13]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy14]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy14]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy15]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy15]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy16]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy16]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy17]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy17]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy18]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy18]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy19]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy19]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy2]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy2]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy20]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy20]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy21]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy21]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy22]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy22]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy23]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy23]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy24]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy24]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy25]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy25]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy26]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy26]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy27]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy27]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy28]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy28]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy29]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy29]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy3]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy3]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy30]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy30]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy31]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy31]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy4]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy4]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy5]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy5]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy6]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy6]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy7]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy7]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy8]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy8]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy9]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy9]

set_false_path -to [get_ports {result_all[*]}]
set_false_path -to [get_ports image_rdy0]
set_false_path -to [get_ports image_rdy1]
set_false_path -to [get_ports image_rdy10]
set_false_path -to [get_ports image_rdy11]
set_false_path -to [get_ports image_rdy12]
set_false_path -to [get_ports image_rdy13]
set_false_path -to [get_ports image_rdy14]
set_false_path -to [get_ports image_rdy15]
set_false_path -to [get_ports image_rdy16]
set_false_path -to [get_ports image_rdy17]
set_false_path -to [get_ports image_rdy18]
set_false_path -to [get_ports image_rdy19]
set_false_path -to [get_ports image_rdy2]
set_false_path -to [get_ports image_rdy20]
set_false_path -to [get_ports image_rdy21]
set_false_path -to [get_ports image_rdy22]
set_false_path -to [get_ports image_rdy23]
set_false_path -to [get_ports image_rdy24]
set_false_path -to [get_ports image_rdy25]
set_false_path -to [get_ports image_rdy26]
set_false_path -to [get_ports image_rdy27]
set_false_path -to [get_ports image_rdy28]
set_false_path -to [get_ports image_rdy29]
set_false_path -to [get_ports image_rdy3]
set_false_path -to [get_ports image_rdy30]
set_false_path -to [get_ports image_rdy31]
set_false_path -to [get_ports image_rdy4]
set_false_path -to [get_ports image_rdy5]
set_false_path -to [get_ports image_rdy6]
set_false_path -to [get_ports image_rdy7]
set_false_path -to [get_ports image_rdy8]
set_false_path -to [get_ports image_rdy9]
