set CLOCK	10.000
create_clock -period [expr $CLOCK] -name clk -add [get_ports clk]
set_clock_uncertainty -setup [expr $CLOCK*0.01] [get_ports clk]
set_clock_uncertainty -hold [expr $CLOCK*0.01] [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {biases[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {biases[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel0[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel0[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel1[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel1[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel10[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel10[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel11[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel11[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel12[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel12[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel13[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel13[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel14[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel14[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel15[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel15[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel16[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel16[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel17[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel17[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel18[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel18[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel19[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel19[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel2[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel2[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel20[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel20[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel21[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel21[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel22[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel22[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel23[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel23[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel24[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel24[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel25[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel25[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel26[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel26[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel27[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel27[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel28[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel28[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel29[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel29[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel3[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel3[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel30[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel30[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel31[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel31[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel4[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel4[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel5[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel5[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel6[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel6[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel7[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel7[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel8[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel8[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel9[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel9[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports biases_vld]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports biases_vld]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_vld]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_vld]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld0]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld0]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld1]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld1]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld10]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld10]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld11]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld11]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld12]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld12]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld13]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld13]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld14]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld14]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld15]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld15]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld16]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld16]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld17]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld17]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld18]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld18]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld19]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld19]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld2]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld2]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld20]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld20]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld21]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld21]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld22]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld22]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld23]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld23]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld24]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld24]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld25]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld25]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld26]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld26]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld27]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld27]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld28]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld28]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld29]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld29]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld3]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld3]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld30]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld30]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld31]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld31]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld4]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld4]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld5]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld5]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld6]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld6]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld7]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld7]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld8]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld8]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_vld9]
set_input_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_vld9]

set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {biases_out[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {biases_out[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {image_out[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {image_out[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {kernel_all[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports {kernel_all[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports biases_rdy]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports biases_rdy]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports image_rdy]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports image_rdy]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy0]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy0]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy1]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy1]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy10]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy10]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy11]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy11]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy12]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy12]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy13]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy13]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy14]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy14]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy15]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy15]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy16]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy16]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy17]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy17]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy18]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy18]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy19]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy19]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy2]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy2]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy20]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy20]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy21]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy21]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy22]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy22]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy23]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy23]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy24]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy24]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy25]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy25]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy26]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy26]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy27]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy27]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy28]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy28]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy29]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy29]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy3]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy3]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy30]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy30]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy31]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy31]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy4]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy4]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy5]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy5]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy6]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy6]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy7]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy7]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy8]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy8]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports kernel_rdy9]
set_output_delay -clock [get_clocks clk] -max -add_delay [expr $CLOCK*0.01*0.5] [get_ports kernel_rdy9]
